notes/initramfs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Созданиe initramfs</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" href="../static/favicon.ico">
<link rel="stylesheet" href="../static/org.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Созданиe initramfs</h1>
<p>
Initramfs, сокращенно от “initial RAM file system”, является приемником initrd (initial ramdisk). Это cpio (copy in and out) архив исходной файловой системы, который загружается в память во время процесса запуска Linux. Linux копирует содержимое архива в rootfs (которая может быть основана на ramfs либо на tmpfs), а затем запускает init. Init предназначен для выполнения определенных задач до того, как реальная или финальная файловая система будет установлена поверх rootfs. Таким образом, initramfs должен содержать все драйвера устройств и инструменты, необходимые для установки конечной корневой файловой системы.
</p>

<p>
Скачиваем busybox (вы можете скачать более новую версию):
</p>
<div class="org-src-container">
<pre class="src src-sh">wget https://busybox.net/downloads/busybox-1.26.2.tar.bz2
tar -xvf busybox-1.26.2.tar.bz2
</pre>
</div>

<p>
Собираем busybox из исходников:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">cd</span> busybox-1.26.2
make defconfig
make menuconfig
</pre>
</div>

<p>
В меню Busybox Settings выбираем Build Options, и ставим галочку напротив Build BusyBox as a static binary (no shared libs). Далее указываем выходную папку для бинарников и собираем busybox.
</p>
<div class="org-src-container">
<pre class="src src-sh">make
make <span class="org-variable-name">CONFIG_PREFIX</span>=./../busybox_rootfs install
</pre>
</div>

<p>
Создаем иерархию каталогов для initramfs:
</p>
<div class="org-src-container">
<pre class="src src-sh">mkdir -p initramfs/{bin,dev,etc,home,mnt,proc,sys,usr}
<span class="org-builtin">cd</span> initramfs/dev
sudo mknod sda b 8 0
sudo mknod console c 5 1
</pre>
</div>

<p>
Так же копируем все из папки busybox<sub>rootfs</sub> в папку initramfs. Дальше создаем в корне initramfs файл init, и пишем в него следующее:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/</span><span class="org-keyword">sh</span>
mount -t proc none /proc
mount -t sysfs none /sys
<span class="org-keyword">exec</span> /bin/sh
</pre>
</div>

<p>
И даем ему права на исполнение:
</p>
<div class="org-src-container">
<pre class="src src-sh">chmod +x init
</pre>
</div>

<p>
Создаем сам initramfs: 
</p>
<div class="org-src-container">
<pre class="src src-sh">find . -print0 | cpio --null -ov --format=newc &gt; initramfs.cpio
gzip ./initramfs.cpio
</pre>
</div>

<p>
Скачиваем и собираем ядро (вы можете скачать более новую версию):
</p>
<div class="org-src-container">
<pre class="src src-sh">wget https://cdn.kernel.org/pub/linux/kernel/v4.x/linux-4.11.6.tar.xz
tar -xvf linux-4.11.6.tar.xz
make x86_64_defconfig
make kvmconfig
make -j2
</pre>
</div>

<p>
Образ ядра будет лежать в /arch/x86<sub>64</sub>/boot/bzImage.
</p>

<p>
Дальше копируем куда-то наш initramfs и ядро, заходим в эту директорию и запускаем qemu:
</p>
<div class="org-src-container">
<pre class="src src-sh">qemu-system-x86_64 -kernel ./bzImage -initrd ./initramfs.cpio.gz -nographic -append <span class="org-string">"console=ttyS0"</span>
</pre>
</div>

<p>
Если все было выполнено правильно, то загрузится ядро и запустится shell. 
</p>
</div>
<div id="postamble" class="status">
<p class="creator">Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org/">Org</a> mode 9.5.5)</p>
</div>
</body>
</html>
